app/controllers/admissions_controller.rb

  def index
    @admissions = Admission.all
---
SELECT * FROM `admissions`

  def show
    @admission = Admission.find(params[:id])
---
SELECT * FROM `admissions` WHERE (`admissions`.`id` = 1)

  def edit
    @admission = Admission.find(params[:id])
---
SELECT * FROM `admissions` WHERE (`admissions`.`id` = 2)

  def create
    @admission = Admission.new(params[:admission])
    @admission.patient_id = params[:patient_id] #setting foreign key

    respond_to do |format|
      if @admission.save
---
INSERT INTO `admissions` (`bed`, `clinicalsummary`, `updated_at`, `admdate`, `patient_id`, `depdate`, `primaryindication`, `ward`, `created_at`) VALUES('4', 'Hydrocephalus following excessive snuff intake.', '2009-07-29 16:07:49', '2009-07-29 16:06:00', 1, '2011-04-29 18:06:00', 'Fat head', 'Barley', '2009-07-29 16:07:49')

  def update
    @admission = Admission.find(params[:id])

    respond_to do |format|
      if @admission.update_attributes(params[:admission])
---
SELECT * FROM `admissions` WHERE (`admissions`.`id` = 2)
UPDATE `admissions` SET `patient_id` = 1, `updated_at` = '2009-07-29 16:43:05' WHERE `id` = 2