app/controllers/patients_controller.rb

SELECT * FROM `patients`
---
  def index
    @patients = Patient.all

SELECT * FROM `patients` WHERE (`patients`.`id` = 1)
SELECT * FROM `admissions` WHERE (`admissions`.patient_id = 1) ORDER BY admissions.id DESC LIMIT 1
---
  def show
    @patient = Patient.find(params[:id])
   @admissions = @patient.admissions.all  #rf

SELECT * FROM `patients` WHERE (`patients`.`id` = 1)
---
  def edit
    @patient = Patient.find(params[:id])

INSERT INTO `patients` (`dob`, `updated_at`, `middlename`, `firstname`, `sensitivities`, `allergies`, `surname`, `created_at`) VALUES('2004-06-12', '2009-07-29 15:34:32', 'Sebastian', 'Johan', 'Dairy', 'Penicillin', 'Bach', '2009-07-29 15:34:32')
---
  def create
    @patient = Patient.new(params[:patient])

    respond_to do |format|
      if @patient.save

SELECT * FROM `patients` WHERE (`patients`.`id` = 1)
UPDATE `patients` SET `dob` = '1900-06-12', `updated_at` = '2009-07-30 10:36:19' WHERE `id` = 1
---
  def update
    @patient = Patient.find(params[:id])

    respond_to do |format|
      if @patient.update_attributes(params[:patient])